sinferwu/stm32f4-vscode/cube/Src/main.c
// /* USER CODE BEGIN Header */
// /**
//   ******************************************************************************
//   * @file           : main.c
//   * @brief          : Main program body
//   ******************************************************************************
//   * @attention
//   *
//   * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
//   * All rights reserved.</center></h2>
//   *
//   * This software component is licensed by ST under BSD 3-Clause license,
//   * the "License"; You may not use this file except in compliance with the
//   * License. You may obtain a copy of the License at:
//   *                        opensource.org/licenses/BSD-3-Clause
//   *
//   ******************************************************************************
//   */
// /* USER CODE END Header */

// /* Includes ------------------------------------------------------------------*/
// #include "main.h"

// /* Private includes ----------------------------------------------------------*/
// /* USER CODE BEGIN Includes */

// /* USER CODE END Includes */

// /* Private typedef -----------------------------------------------------------*/
// /* USER CODE BEGIN PTD */

// /* USER CODE END PTD */

// /* Private define ------------------------------------------------------------*/
// /* USER CODE BEGIN PD */
// /* USER CODE END PD */

// /* Private macro -------------------------------------------------------------*/
// /* USER CODE BEGIN PM */

// /* USER CODE END PM */

// /* Private variables ---------------------------------------------------------*/

// /* USER CODE BEGIN PV */

// /* USER CODE END PV */

// /* Private function prototypes -----------------------------------------------*/
// void SystemClock_Config(void);
// static void MX_GPIO_Init(void);
// /* USER CODE BEGIN PFP */

// /* USER CODE END PFP */

// /* Private user code ---------------------------------------------------------*/
// /* USER CODE BEGIN 0 */

// /* USER CODE END 0 */

// /**
//   * @brief  The application entry point.
//   * @retval int
//   */
// int main(void)
// {
//   /* USER CODE BEGIN 1 */

//   /* USER CODE END 1 */
  

//   /* MCU Configuration--------------------------------------------------------*/

//   /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
//   HAL_Init();

//   /* USER CODE BEGIN Init */

//   /* USER CODE END Init */

//   /* Configure the system clock */
//   SystemClock_Config();

//   /* USER CODE BEGIN SysInit */

//   /* USER CODE END SysInit */

//   /* Initialize all configured peripherals */
//   MX_GPIO_Init();
//   /* USER CODE BEGIN 2 */

//   /* USER CODE END 2 */
 
 

//   /* Infinite loop */
//   /* USER CODE BEGIN WHILE */
//   while (1)
//   {
//     HAL_GPIO_WritePin (GPIOA,GPIO_PIN_6,GPIO_PIN_RESET);
// 		//将PF9拉低
// 		HAL_GPIO_WritePin(GPIOA,GPIO_PIN_7,GPIO_PIN_SET);
// 		//将PF10拉高
// 		HAL_Delay(1000);//延时1000ms
// 		HAL_GPIO_WritePin (GPIOA,GPIO_PIN_6,GPIO_PIN_SET);
// 		//将PF9拉高
// 		HAL_GPIO_WritePin(GPIOA,GPIO_PIN_7,GPIO_PIN_RESET);
// 		//将PF10拉低
// 		HAL_Delay(1000);
//     /* USER CODE END WHILE */

//     /* USER CODE BEGIN 3 */
//   }
//   /* USER CODE END 3 */
// }

// /**
//   * @brief System Clock Configuration
//   * @retval None
//   */
// void SystemClock_Config(void)
// {
//   RCC_OscInitTypeDef RCC_OscInitStruct = {0};
//   RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

//   /** Configure the main internal regulator output voltage 
//   */
//   __HAL_RCC_PWR_CLK_ENABLE();
//   __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);
//   /** Initializes the CPU, AHB and APB busses clocks 
//   */
//   RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
//   RCC_OscInitStruct.HSIState = RCC_HSI_ON;
//   RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
//   RCC_OscInitStruct.PLL.PLLState = RCC_PLL_NONE;
//   if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
//   {
//     Error_Handler();
//   }
//   /** Initializes the CPU, AHB and APB busses clocks 
//   */
//   RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
//                               |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
//   RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSI;
//   RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV2;
//   RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
//   RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

//   if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_0) != HAL_OK)
//   {
//     Error_Handler();
//   }
// }

// /**
//   * @brief GPIO Initialization Function
//   * @param None
//   * @retval None
//   */
// static void MX_GPIO_Init(void)
// {
//   GPIO_InitTypeDef GPIO_InitStruct = {0};

//   /* GPIO Ports Clock Enable */
//   __HAL_RCC_GPIOC_CLK_ENABLE();
//   __HAL_RCC_GPIOH_CLK_ENABLE();
//   __HAL_RCC_GPIOA_CLK_ENABLE();
//   __HAL_RCC_GPIOB_CLK_ENABLE();

//   /*Configure GPIO pin Output Level */
//   HAL_GPIO_WritePin(GPIOA, GPIO_PIN_6|GPIO_PIN_7, GPIO_PIN_RESET);

//   /*Configure GPIO pins : PA6 PA7 */
//   GPIO_InitStruct.Pin = GPIO_PIN_6|GPIO_PIN_7;
//   GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
//   GPIO_InitStruct.Pull = GPIO_NOPULL;
//   GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
//   HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

// }

// /* USER CODE BEGIN 4 */

// /* USER CODE END 4 */

// /**
//   * @brief  This function is executed in case of error occurrence.
//   * @retval None
//   */
// void Error_Handler(void)
// {
//   /* USER CODE BEGIN Error_Handler_Debug */
//   /* User can add his own implementation to report the HAL error return state */

//   /* USER CODE END Error_Handler_Debug */
// }

// #ifdef  USE_FULL_ASSERT
// /**
//   * @brief  Reports the name of the source file and the source line number
//   *         where the assert_param error has occurred.
//   * @param  file: pointer to the source file name
//   * @param  line: assert_param error line source number
//   * @retval None
//   */
// void assert_failed(uint8_t *file, uint32_t line)
// { 
//   /* USER CODE BEGIN 6 */
//   /* User can add his own implementation to report the file name and line number,
//      tex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
//   /* USER CODE END 6 */
// }
// #endif /* USE_FULL_ASSERT */

// /************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/

#include "stm32f4xx.h"
#include "bsp.h"
#include "includes.h"

#define  TEST_TASK_STK_SIZE     256
#define  TEST_Idle_STK_SIZE     256
#define  OSTASK_TEST_PRIO       3
#define  OSTASK_Idle_PRIO       5

static void  Test_Task(void *p_arg);
static void  Test_Idle(void *p_arg);

// 任务控制块
static  OS_TCB   Test_Task_TCB;
static  OS_TCB   Test_Idle_TCB;

// 任务堆栈的大小为数组所占空间的大小 32位整型*256 = 1024
static  CPU_STK  Test_Task_STK[TEST_TASK_STK_SIZE];
static  CPU_STK  Test_Idle_STK[TEST_TASK_STK_SIZE];

void TaskCreateAppTask(void);

static void Test_Task(void *p_arg)
{
	OS_ERR  err;
	(void)p_arg;

	TaskCreateAppTask();
	
	while(1) 
	{
        Led_On();
        OSTimeDlyHMSM(0, 0,1, 0,OS_OPT_TIME_HMSM_STRICT,&err);
        Led_Off();
        OSTimeDlyHMSM(0, 0,1,0,OS_OPT_TIME_HMSM_STRICT,&err);
	}
}

static void Test_Idle(void *p_arg)
{
	OS_ERR  err;
	(void)p_arg;

	while(1) 
	{
        //精确延时
        OSTimeDlyHMSM(0, 0, 1,0,OS_OPT_TIME_HMSM_STRICT,&err);
	}
}

void TaskCreateAppTask(void)
{
    OS_ERR  err;

/* 
    uC/OS-II有两个用来创建任务的函数:OSTaskCreate()和OSTaskCreateExt()
    OSTaskCreate ()函数主要完成3项工作:
        1. 任务堆栈的初始化
        2. 任务控制块的初始化
        3. 任务调度
    任务代码的指针并不是存放在任务控制块中的,而是存放在任务堆栈里面
*/

    OSTaskCreate((OS_TCB       *)&Test_Idle_TCB,              /* Create the start task                                */
                    (CPU_CHAR     *)"Idle",
                    (OS_TASK_PTR   )Test_Idle,
                    (void         *)0u,
                    (OS_PRIO       )OSTASK_Idle_PRIO,
                    (CPU_STK      *)&Test_Idle_STK[0u],
                    (CPU_STK_SIZE  )Test_Idle_STK[TEST_Idle_STK_SIZE / 10u],
                    (CPU_STK_SIZE  )TEST_Idle_STK_SIZE,
                    (OS_MSG_QTY    )0u,
                    (OS_TICK       )0u,
                    (void         *)0u,
                    (OS_OPT        )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR),
                    (OS_ERR       *)&err);

}

void TaskCreate(void)
{
    OS_ERR  err;
					 
    OSTaskCreate((OS_TCB       *)&Test_Task_TCB,              /* Create the start task                                */
                 (CPU_CHAR     *)"TEST",
                 (OS_TASK_PTR   )Test_Task,
                 (void         *)0u,
                 (OS_PRIO       )OSTASK_TEST_PRIO,
                 (CPU_STK      *)&Test_Task_STK[0u],
                 (CPU_STK_SIZE  )Test_Task_STK[TEST_TASK_STK_SIZE / 10u],
                 (CPU_STK_SIZE  )TEST_TASK_STK_SIZE,
                 (OS_MSG_QTY    )0u,
                 (OS_TICK       )0u,
                 (void         *)0u,
                 (OS_OPT        )(OS_OPT_TASK_STK_CHK | OS_OPT_TASK_STK_CLR),
                 (OS_ERR       *)&err);
}


int main(){
	OS_ERR  err;
	
	Bsp_Init();

    /*
        OSInit工作
        基础参数初始化 Initialize miscellaneous(混杂的,各种各样的) variables 
        初始化任务就绪表 Initialize the Ready List 
        初始化任务控制块 Initialize the free list of OS_TCBs 
        初始化事件控制块 Initialize the free list of OS_EVENTs 
    */
	OSInit(&err); 

	/* Create the start task */
	TaskCreate();
    /*  
        OSStart工作
        该函数由SStart()函数调用
        功能是运行优先级最高的就绪任务
        在调用OSStart()之前,用户必须先调用OSInit()，并且已经至少创建了一个任务.
    */
	OSStart(&err);
	(void)&err;
	return (0u);
}